<?php

//程序运行时的常量

return [

    //省级编号
    'ProvinceCode'=>[
        //省
        13=>'河北省',
        14=>'山西省',
        21=>'辽宁省',
        22=>'吉林省',
        32=>'江苏省',
        33=>'浙江省',
        34=>'安徽省',
        35=>'福建省',
        36=>'江西省',
        37=>'山东省',
        41=>'河南省',
        42=>'湖北省',
        43=>'湖南省',
        44=>'广东省',
        46=>'海南省',
        51=>'四川省',
        52=>'贵州省',
        53=>'云南省',
        61=>'陕西省',
        62=>'甘肃省',
        63=>'青海省',
        83=>'台湾省',
        23=>'黑龙江省',
        //直辖市
        11=>'北京市',
        12=>'天津市',
        31=>'上海市',
        50=>'重庆市',
        //自治区
        54=>'西藏自治区',
        15=>'内蒙古自治区',
        64=>'宁夏回族自治区',
        45=>'广西壮族自治区',
        65=>'新疆维吾尔自治区',
        //特别行政区
        81=>'香港特別行政區',
        82=>'澳門特別行政區',
    ],

    //用省编号转英文
    'EnglishProvince'=>[
        //省
        13=>'hebei',
        14=>'shanxi',
        21=>'liaoning',
        22=>'jilin',
        32=>'jiangsu',
        33=>'zhejiang',
        34=>'anhui',
        35=>'fujian',
        36=>'jiangxi',
        37=>'shandong',
        41=>'henan',
        42=>'hubei',
        43=>'hunan',
        44=>'guangdong',
        46=>'hainan',
        51=>'sichuan',
        52=>'guizhou',
        53=>'yunnan',
        61=>'shaanxi',
        62=>'gansu',
        63=>'qinghai',
        83=>'taiwan',
        23=>'heilongjiang',
        //直辖市
        11=>'beijing',
        12=>'tianjin',
        31=>'shanghai',
        50=>'chongqing',
        //自治区
        54=>'xizang',
        15=>'neimenggu',
        64=>'ningxia',
        45=>'guangxi',
        65=>'xinjiang',
        //特别行政区
        81=>'xianggang',
        82=>'aomen',
    ],

    //海区域
    'SeaArea'=>[
        999=>'SeaArea',
    ],
    //===================================================================================================
    //高德企业开发者 每个key每天上限300万次 get
    'AmapKey'=>[
        '22cbff6c809b5b775dc560da0635ef5a',
        '5effa388c72b1298f93b17113f6e81c0',
        'a1f485ffefe558082dd29531f7a57618',
        '216c2412085767fbea0fefed50875ca9',
        'b8b758c8ac5c35ca44090f64fb57129a',
        'd56ee09cffb6b2ef5fe4905d2522f303',
        '4f920b9e43b988edbd144554c18e5882',
        'd29a42863b65b8711e5220977f36829c',
        'a2f7fe6132c68b448ea8203a7f9e3829',
        '499cc45b2ca6f49fdea4b73d528c38f0',
    ],

    'AmapUrl'=>'https://restapi.amap.com/v3/geocode/regeo',
    //===================================================================================================
    //腾讯开发者 每天上限未知 get
    'TencentKey'=>[
        'F3CBZ-OMCW3-IH43S-37HGQ-HOCYH-HHB7P',
    ],

    'TencentUrl'=>'https://apis.map.qq.com/ws/geocoder/v1',
    //===================================================================================================
    //百度翻译 每月上限200万次 get
    'BaiduAppId'=>['20190319000278847'],

    'BaiduKey'=>['9cSZOGwC8gczh5koGuEE'],

    'BaiduUrl'=>'https://fanyi-api.baidu.com/api/trans/vip/translate',
    //===================================================================================================









];
