<?php

//返回请求时统一返回值

return [

    '200'=>200,//正常
    '600'=>600,//api接口被暴力请求
    '601'=>601,//uid是空
    '602'=>602,//redis操作错误
    '603'=>603,//已经签到
    '604'=>604,//参数错误
    '605'=>605,//格子不存在
    '606'=>606,//格子不可交易
    '607'=>607,//金钱不够
    '608'=>608,//购买失败
    '609'=>609,//该格子当天交易已到最大限制
    '610'=>610,//购地卡没了
    '611'=>611,//格子没有所有者
    '612'=>612,//新格子名称不能是空
    '613'=>613,//新格子名称有违禁词
    '614'=>614,//建立成就表失败
    '615'=>615,//不能买自己的格子
    '616'=>616,//参数不能是空
    '617'=>617,//参数长度超限
    '618'=>618,//
    '619'=>619,//
    '620'=>620,//







];
